<a href="https://colab.research.google.com/github/07-Atharv/oasis_internship/blob/main/%F0%9D%92%90%F0%9D%92%8A%F0%9D%92%83%F0%9D%92%94%F0%9D%92%8A%F0%9D%92%91_%F0%9D%92%95%F0%9D%92%82%F0%9D%92%94%F0%9D%92%8C%F0%9D%92%8F%F0%9D%92%904.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import nltk #(natural language tool-kit)
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder 
import seaborn as sea
from nltk.corpus import stopwords
import string
from nltk.stem.porter import PorterStemmer

In [ ]:
df=pd.read_csv('spam.csv',encoding='latin1')

In [ ]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [ ]:
df.describe()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

# Converting categorical data to numerical data

In [ ]:
encoder = LabelEncoder()
df['v1'] = encoder.fit_transform(df['v1']) #allotting 0,1
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,0,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,0,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,1,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,0,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,0,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [ ]:
print("Total Duplicated values =",df.duplicated().sum())

Total Duplicated values = 403

In [ ]:
df = df.drop_duplicates(keep='first')

In [ ]:
df['v1'].value_counts()

0    4516
1     653
Name: v1, dtype: int64

In [ ]:
df['sentence'] = df['v2'].apply(lambda x:len(nltk.sent_tokenize(x))) 
df.sample(4)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4,sentence
1881,0,Ok.. ÌÏ finishing soon?,NaN,NaN,NaN,1
2109,0,Lara said she can loan me &lt;#&gt; .,NaN,NaN,NaN,1
4907,0,"I'm in solihull, | do you want anything?",NaN,NaN,NaN,1
1919,0,Yar i wanted 2 scold u yest but late already.....,NaN,NaN,NaN,4

In [ ]:
df['words'] = df['v2'].apply(lambda x:len(nltk.word_tokenize(x))) 
df.sample(4)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4,sentence,words
4948,0,I am in bus on the way to calicut,NaN,NaN,NaN,1,9
778,0,Happy New year my dear brother. I really do mi...,NaN,NaN,NaN,4,30
3443,0,Yes but I don't care cause I know its there!,NaN,NaN,NaN,1,12
2373,1,XMAS Prize draws! We are trying to contact U. ...,NaN,NaN,NaN,4,31

In [ ]:

df['chars']= df['v2'].apply(len)
df.sample(4)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4,sentence,words,chars
1009,0,"Dear Hero,i am leaving to qatar tonite for an ...",NaN,NaN,NaN,1,27,108
689,1,<Forwarded from 448712404000>Please CALL 08712...,NaN,NaN,NaN,1,19,111
5295,0,Alex says he's not ok with you not being ok wi...,NaN,NaN,NaN,1,13,51
221,0,There is os called ubandu which will run witho...,NaN,NaN,NaN,1,33,161

In [ ]:
sum=df[df['v1'] == 1][['words','sentence','chars']]
sum.describe()

            words    sentence       chars
count  653.000000  653.000000  653.000000
mean    27.667688    2.970904  137.891271
std      7.008418    1.488425   30.137753
min      2.000000    1.000000   13.000000
25%     25.000000    2.000000  132.000000
50%     29.000000    3.000000  149.000000
75%     32.000000    4.000000  157.000000
max     46.000000    9.000000  224.000000

In [ ]:
sum=df[df['v1'] == 0][['words','sentence','chars']]
sum.describe()

             words     sentence        chars
count  4516.000000  4516.000000  4516.000000
mean     17.123782     1.820195    70.459256
std      13.493970     1.383657    56.358207
min       1.000000     1.000000     2.000000
25%       8.000000     1.000000    34.000000
50%      13.000000     1.000000    52.000000
75%      22.000000     2.000000    90.000000
max     220.000000    38.000000   910.000000

In [ ]:
nltk.download('punkt')

[nltk_data] Downloading package punkt to
[nltk_data]     C:\Users\indul\AppData\Roaming\nltk_data...
[nltk_data]   Package punkt is already up-to-date!

True

In [ ]:

nltk.download('stopwords')
stopwords.words('english')[:13]

[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\indul\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

['i',
 'me',
 'my',
 'myself',
 'we',
 'our',
 'ours',
 'ourselves',
 'you',
 "you're",
 "you've",
 "you'll",
 "you'd"]

In [ ]:
ps = PorterStemmer()
ps.stem('from')

'from'

In [ ]:
string.punctuation

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [ ]:
def changement(a):

    a = a.lower()
    
    tokens = nltk.word_tokenize(a)
    
    alphanum = [t for t in tokens if t.isalnum() and t not in stopwords.words('english')]
    
    ps = PorterStemmer()
    stemmed_tokens = [ps.stem(t) for t in alphanum]
    
    return " ".join(stemmed_tokens)

In [ ]:
df['pre-processed'] = df['v2'].apply(changement)
df.tail(8)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4,sentence,words,chars,pre-processed
5564,0,Why don't you wait 'til at least wednesday to ...,NaN,NaN,NaN,1,16,67,wait least wednesday see get
5565,0,Huh y lei...,NaN,NaN,NaN,1,4,12,huh lei
5566,1,REMINDER FROM O2: To get 2.50 pounds free call...,NaN,NaN,NaN,1,30,147,remind o2 get pound free call credit detail gr...
5567,1,This is the 2nd time we have tried 2 contact u...,NaN,NaN,NaN,4,35,161,2nd time tri 2 contact u pound prize 2 claim e...
5568,0,Will Ì_ b going to esplanade fr home?,NaN,NaN,NaN,1,9,37,b go esplanad fr home
5569,0,"Pity, * was in mood for that. So...any other s...",NaN,NaN,NaN,2,15,57,piti mood suggest
5570,0,The guy did some bitching but I acted like i'd...,NaN,NaN,NaN,1,27,125,guy bitch act like interest buy someth els nex...
5571,0,Rofl. Its true to its name,NaN,NaN,NaN,2,7,26,rofl true name

In [ ]:
df.shape

(5169, 9)

In [ ]:
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score
Y = df['v1'].values
X = df['pre-processed']

In [ ]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.2,random_state=9)

In [ ]:
print("Total No of Rows  :",X.shape[0])
print("Rows for training :",X_train.shape[0])
print("Rows for testing  :",X_test.shape[0])

Total No of Rows  : 5169
Rows for training : 4135
Rows for testing  : 1034

In [ ]:
feature_extraction = TfidfVectorizer(min_df = 1, stop_words='english', lowercase='True',max_features=3000)

In [ ]:

X_train_features = feature_extraction.fit_transform(X_train)
X_test_features = feature_extraction.transform(X_test)

In [ ]:
X_train_features.shape

(4135, 3000)

In [ ]:
knn=KNeighborsClassifier()
knn.fit(X_train_features, Y_train)

KNeighborsClassifier()

In [ ]:
prediction_on_training_data = knn.predict(X_train_features)
accuracy_on_training_data = accuracy_score(Y_train, prediction_on_training_data)

print('Accuracy on training data : ', accuracy_on_training_data*100)

Accuracy on training data :  92.91414752116081

In [ ]:
prediction_on_training_data = knn.predict(X_train_features)
accuracy_on_training_data = accuracy_score(Y_train, prediction_on_training_data)

print('Accuracy on training data : ', accuracy_on_training_data*100)

Accuracy on training data :  92.91414752116081

# Final Accuracy:
### Accuracy on training data :  92.91414752116081